# Win10 命令提示字元資料

要了解特定命令的詳細資訊，請輸入 HELP 命令名稱

指令  | 說明
------|-------------------------------------------------------------
ASSOC | 顯示或修改檔案副檔名關聯。
ATTRIB | 顯示或變更檔案屬性。
BREAK | 設定或清除擴充的 CTRL+C 檢查。
BCDEDIT | 設定 boot 資料庫檔案的內容來控制開機載入。
CACLS | 顯示或修改檔案的存取控制清單 (ACLs)。
CALL | 從一個批次程式呼叫另一個批次程式。
CD | 顯示或變更目前目錄的名稱。
CHCP | 顯示或設定作用中的字碼頁編號。
CHDIR | 顯示或變更目前目錄的名稱。
CHKDSK | 檢查磁碟並顯示狀態報告。
CHKNTFS | 顯示或修改開機時的磁碟檢查。
CLS | 清除螢幕。
CMD | 開始新的 Windows 命令直譯器。
COLOR | 設定預設主控台的前景和背景色彩。
COMP | 比較兩個或兩組檔案的內容。
COMPACT | 顯示或變更 NTFS 磁碟分割上的檔案壓縮。
CONVERT | 將 FAT 磁碟區轉換成 NTFS 格式。您不可轉換目前的磁碟機。
COPY | 將一個或數個檔案複製到另一個位置。
DATE | 顯示或設定日期。
DEL | 刪除檔案。
DIR | 顯示目錄中的檔案和子目錄清單。
DISKPART | 顯示或設定磁碟分割內容。
DOSKEY | 編輯命令列、重新呼叫 Windows 命令和建立巨集。
DRIVERQUERY | 顯示目前裝置驅動程式狀態和內容。
ECHO | 顯示訊息、開啟或關閉命令回音。
ENDLOCAL | 結束批次檔環境變更的當地語系化工作。
ERASE | 刪除一或多個檔案。
EXIT | 結束 CMD.EXE 程式 (命令直譯器)。
FC | 比較兩個或兩組檔案，然後顯示兩者之間的相異處。
FIND | 搜尋一或多個檔案中的文字字串。
FINDSTR | 在檔案中搜尋字串。
FOR | 在一組檔案中的每個檔案執行一個特定的命令。
FORMAT | 將磁碟格式化供 Windows 使用。
FSUTIL | 顯示或設定檔案系統內容。
FTYPE | 顯示或修改用於檔案副檔名關聯中的檔案類型。
GOTO | 將 Windows 命令直譯器指向批次程式中已經加了標籤的列。
GPRESULT | 顯示電腦或使用者的群組原則資訊。
GRAFTABL | 讓 Windows 在圖形模式下顯示擴充的字元集。
HELP | 為 Windows 命令提供說明資訊。
ICACLS | 顯示、修改、備份或還原檔案與目錄的 ACL。
IF | 在批次程式中執行有條件的處理。
LABEL | 建立、變更或刪除磁碟的磁碟區標籤。
MD | 建立目錄。
MKDIR | 建立目錄。
MKLINK | 建立符號連結與永久連結
MODE | 設定系統裝置。
MORE | 以一次一頁螢幕的方式來顯示輸出。
MOVE | 將一或多個檔案從某個目錄移動到另一個目錄。
OPENFILES | 顯示遠端使用者因檔案共用而開啟的檔案。
PATH | 顯示或設定可執行檔的搜尋路徑。
PAUSE | 暫停處理批次檔並顯示訊息。
POPD | 還原 PUSHD 儲存之目前目錄先前的值。
PRINT | 列印文字檔案。
PROMPT | 變更 Windows 命令提示字元。
PUSHD | 儲存目前的目錄，然後變更它。
RD | 移除目錄。
RECOVER | 從損壞或不良的磁碟中復原可讀取的資訊。
REM | 在批次檔或 CONFIG.SYS 中記錄註解 (備註)。
REN | 重新命名一或多個檔案。
RENAME | 重新命名一或多個檔案。
REPLACE | 取代檔案。
RMDIR | 移除目錄。
ROBOCOPY | 用於複製檔案與目錄樹狀結構的進階公用程式
SET | 顯示、設定或移除 Windows 環境變數。
SETLOCAL | 開始執行批次檔中環境變更的當地語系化工作。
SC | 顯示或設定服務 (背景處理程序)。
SCHTASKS | 排定電腦上要執行的命令與程式。
SHIFT | 變更批次檔中可取代參數的位置。
SHUTDOWN    允許從本機或遠端將電腦關機。
SORT |   將輸入排序。
START |  開始另一個視窗來執行指定的程式或命令。
SUBST |  將路徑與磁碟機代號相關聯。
SYSTEMINFO | 顯示電腦特定內容與設定。
TASKLIST | 顯示所有目前正在執行的工作，包括服務。
TASKKILL | 刪除或停止正在執行的處理程序或應用程式。
TIME | 顯示或設定系統時間。
TITLE | 設定 CMD.EXE 工作階段的視窗標題。
TREE | 以圖形方式顯示磁碟機或路徑的目錄結構。
TYPE | 顯示文字檔的內容。
VER | 顯示 Windows 版本。
VERIFY | 告訴 Windows 是否要檢查您的檔案是否已正確寫入到磁碟。
VOL | 顯示磁碟區標籤與序號。
XCOPY | 複製檔案與目錄樹狀結構。
WMIC | 顯示互動式命令殼層中的 WMI 資訊。
